Revit 2024 API
OverrideGraphicSettings.CutLineWeight Property
 Cut surface line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int CutLineWeight { get; }
Visual Basic
Public ReadOnly Property CutLineWeight As Integer
	Get
Visual C++
public:
property int CutLineWeight {
	int get ();
}
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace